Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Here's how its mapped:
zh_cn: 下面是它的映射方式：

source: Here's the same example, but with the AWS Gateway REST API:
zh_cn: 下面是同样的例子，但是使用了AWS Gateway REST API:

source: Hibernate ORM REST Data with Panache simplifies the creation of CRUD applications based on JAX-RS and Hibernate ORM.
zh_cn: 运用Panache来操作Hibernate ORM REST数据，简化了基于JAX-RS和Hibernate ORM的CRUD应用程序的创建。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate ORM with Panache focuses on making your entities trivial and fun to write in Quarkus.
zh_cn: Hibernate ORM是事实上的JPA实现，提供了全方位的对象关系映射（Object Relational Mapper，简称ORM）支持。它支持编写复杂的映射，但编写简单常用的映射却不够简便。Panache专注于简化Hibernate ORM实体，让你的Quarkus开发有趣。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Panache focuses on making your entities trivial and fun to write.
zh_cn: Hibernate ORM是事实上的JPA实现，提供了全方位的对象关系映射支持。 它支持编写复杂的映射，但编写简单常用的映射却不够简便。 Panache专注于简化Hibernate ORM实体，让你的Quarkus开发有趣。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breath of an Object Relational Mapper. It works beautifully in Quarkus.
zh_cn: Hibernate ORM是事实上的JPA实现，为你提供了对象关系映射器的全部功能。它在Quarkus中工作得很好。

source: Hibernate ORM with Panache relies on compile-time bytecode enhancements to your entities.
zh_cn: Hibernate ORM Panache依赖于编译时对实体类的字节码增强。

source: Hibernate Reactive in Quarkus currently does not support multiple persistence units.
zh_cn: Quarkus中的Hibernate Reactive目前不支持多个持久化单元。

source: Hibernate Reactive with Panache relies on compile-time bytecode enhancements to your entities.
zh_cn: Hibernate Reactive Panache依赖于编译时对实体类的字节码增强。

source: Hibernate Search allows you to index your entities in an Elasticsearch cluster and easily offer full text search in all your Hibernate ORM-based applications.
zh_cn: Hibernate Search允许你在Elasticsearch集群中索引你的实体，并在你所有基于Hibernate ORM的应用程序中轻松提供全文搜索。

source: Hibernate is very general-purpose, but does not make it trivial to do trivial operations that make up 90% of our model usage.
zh_cn: Hibernate很通用，但对于模型里90%的琐碎操作，编写起来并不简单。

source: Hibernate queries are super powerful, but overly verbose for common operations, requiring you to write queries even when you don't need all the parts.
zh_cn: Hibernate查询功能很强大，但对于普通操作来说过于冗长，即使是简单操作也要求写完整的HQL语句。

source: Hibernate will use **DTO projection** and generate a SELECT clause with the attributes from the projection class. This is also called **dynamic instantiation** or **constructor expression**, more info can be found on the Hibernate guide: link:https://docs.jboss.org/hibernate/orm/current/userguide/html_single/Hibernate_User_Guide.html#hql-select-clause[hql select clause]
zh_cn: Hibernate会使用 *DTO投影* ，并根据投影的类的属性生成SELECT子句。这也被称为 *动态实例化* 或 *构造器表达* ，更多信息可以在Hibernate指南中找到： link:https://docs.jboss.org/hibernate/orm/current/userguide/html_single/Hibernate_User_Guide.html#hql-select-clause[HQL select子句]

source: Hit `CTRL+C` to stop the application, or keep it running and enjoy the blazing fast hot-reload.
zh_cn: 点击 `CTRL+C` ，停止应用程序，或保持运行，享受极快的热重载。

source: Hit `CTRL+C` to stop the application.
zh_cn: 使用 `CTRL+C` 来停止应用程序。

source: Hopefully, this will change in the future and make the error more obvious.
zh_cn: 希望这在将来会有所改变，使错误更加明显。

source: How and why we simplify Hibernate ORM mappings
zh_cn: 我们为什么简化Hibernate ORM映射？怎么做到的？

source: How and why we simplify Hibernate Reactive mappings
zh_cn: 我们为什么简化Hibernate Reactive映射？怎么做到的？

source: How and why we simplify MongoDB API
zh_cn: 我们如何以及为什么要简化MongoDB的API

source: How capabilities are implemented and used in Quarkus.
zh_cn: 在Quarkus中如何实现和使用功能。

source: How dev mode differs from a production application
zh_cn: 开发模式与生产应用程序有何不同

source: How to Add SmallRye JWT directly
zh_cn: 如何直接添加SmallRye JWT

source: How to Create Quarkus Documentation
zh_cn: 如何创建Quarkus文档

source: How to check the errors in the logs
zh_cn: 如何检查日志中的错误

source: How to use 'client-id' property
zh_cn: 如何使用 `client-id` 属性

source: How to use custom Redis Commands
zh_cn: 如何使用自定义Redis命令

source: However, HTTP characteristics prohibit implementing <a href="https://www.reactivemanifesto.org/">reactive systems</a>, where all the components interact using asynchronous messages passing.
zh_cn: 然而，HTTP的特性禁止实现<a href="https://www.reactivemanifesto.org/">响应式系统</a>，即所有组件都使用异步消息传递进行交互。

source: However, `@RequestScoped` must be used when the individual token claims are injected as simple types such as `String`, for example:
zh_cn: 然而，当单个令牌要求被注入为简单的类型，例如 `String` ，必须使用 `@RequestScoped` ：

source: However, there could be cases where JWT tokens must be verified via the introspection only. It can be forced by configuring an introspection endpoint address only, for example, in case of Keycloak you can do it like this:
zh_cn: 然而，在某些情况下，JWT令牌必须只通过自省来验证。它可以通过配置一个自省端点地址来强制进行，例如，在Keycloak的情况下，你可以这样做：

source: However, when working with a multi-module project, be sure to read the `Working with multi-module projects` section of the xref:maven-tooling.adoc#multi-module-maven[Maven] or xref:gradle-tooling.adoc#multi-module-maven[Gradle] guides.
zh_cn: 不过，在处理多模块项目时，请务必阅读 link:maven-tooling.html#multi-module-maven[Maven] 或 link:gradle-tooling.html#multi-module-maven[Gradle] 指南中的 `多模块项目` 部分。

source: However, you can go right to the completed example.
zh_cn: 然而，你可以直接进入完成的例子。

source: I could mock it with the following class in `src/test/java`:
zh_cn: 我可以在 `src/test/java` 中用以下类来mock它：

source: I don't need transaction when I do read only operations, it's faster.
zh_cn: 当我做只读操作时，就不需要事务，这样会更快

source: ID Generator
zh_cn: ID生成器（ID Generator）

source: IDs are often a touchy subject, and not everyone's up for letting them handled by the framework, once again we have you covered.
zh_cn: ID往往是一个敏感的话题，并不是所有人都愿意让框架来处理，因此我们提供了相应的配置。

source: IDs are often a touchy subject. In MongoDB, they are usually auto-generated by the database with an `ObjectId` type. In MongoDB with Panache the ID are defined by a field named `id` of the `org.bson.types.ObjectId` type, but if you want to customize them, once again we have you covered.
zh_cn: ID往往是一个敏感的话题。在MongoDB中，，它们通常由数据库以 `ObjectId` 类型自动生成。 在带有 Panache 的 MongoDB 中，ID是由一个名为 `org.bson.types.ObjectId` 类型的名为 `id` 的字段定义的，但如果你想自定义它们，我们再次为您提供服务。

source: Identifier of a CDI bean that provides the default Kafka consumer/producer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier. Type: _string_
zh_cn: 为通道提供默认Kafka消费者/生产者配置的CDI bean的标识符。通道自身的配置仍可以覆盖任何属性。该bean必须有一个Map<String, Object>的类型，并且必须使用@io.smallrye.common.annotation.Identifier限定符来设置标识符。 类型: _string_

source: Identity providers
zh_cn: 身份提供者（Identity Providers）

source: If UserInfo is the source of the roles then set `quarkus.oidc.authentication.user-info-required=true` and `quarkus.oidc.roles.source=userinfo`, and if needed, `quarkus.oidc.roles.role-claim-path`.
zh_cn: 如果使用UserInfo为角色的来源，那么要设置 `quarkus.oidc.authentication.user-info-required=true` 和 `quarkus.oidc.roles.source=userinfo` ，如果需要的话，设置 `quarkus.oidc.roles.role-claim-path` 。

source: If `groups` claim is available then its value is used
zh_cn: 如果存在 `groups` 声明，则这个声明的值会被使用

source: If `kafka-configuration` is set and no `Map` can be found, the deployment fails.
zh_cn: 如果设置了 `kafka-configuration` ，但没有找到 `Map` ，则部署会失败。

source: If `quarkus.oidc.roles.role-claim-path` property is set and matching array or string claims are found then the roles are extracted from these claims. For example, `customroles`, `customroles/array`, `scope`, `"http://namespace-qualified-custom-claim"/roles`, `"http://namespace-qualified-roles"`, etc.
zh_cn: 如果 `quarkus.oidc.roles.role-claim-path` 属性被设置，并且找到匹配的数组或字符串声明，那么角色将从这些声明中提取。例如， `customroles` , `customroles/array` , `scope` , `"http://namespace-qualified-custom-claim"/roles` , `"http://namespace-qualified-roles"` , 等等。

source: If `realm_access/roles` or `resource_access/client_id/roles` (where `client_id` is the value of the `quarkus.oidc.client-id` property) claim is available then its value is used. This check supports the tokens issued by Keycloak
zh_cn: 如果 `realm_access/roles` 或 `resource_access/client_id/roles` （其中 `client_id` 是 `quarkus.oidc.client-id` 属性的值）声明是存在的，那么它的值会被使用。该检查支持由Keycloak发行的令牌

source: If a `client.id` is not provided, it is generated as `kafka-consumer-[channel][-index]`.
zh_cn: 如果没有提供 `client.id` ，则使用 `kafka-consumer-[channel][-index]` 来生成 。

source: If a `client.id` is provided, it is used as-is or suffixed with client index if `partitions` property is set.
zh_cn: 如果提供了一个 `client.id` ，它将直接被使用， 或者如果 `partitions` 属性被设置的话，则会被加上客户端索引的后缀。

source: If a custom realm file has to be imported into Keycloak before running the tests then you can configure `Dev Services for Keycloak` as follows:
zh_cn: 如果在运行测试前必须将自定义领域文件导入Keycloak，那么你可以按以下方式配置 `Keycloak开发服务` ：

source: If a message produced from a Kafka record is nacked, a failure strategy is applied. The Kafka connector supports three strategies:
zh_cn: 如果从Kafka record中产生的消息未被确认，那么一个失败策略就会被启用。Kafka connector支持三种策略：

source: If a message produced from an AMQP message is _nacked_, a failure strategy is applied. The AMQP connector supports six strategies:
zh_cn: 如果一个由AMQP消息产生的消息是 _nacked_ ，就会应用一个失败策略。AMQP连接器支持六种策略：

source: If a method annotated with `@ConsumeEvent` throws an exception, then:
zh_cn: 如果一个用 `@ConsumeEvent` 注解的方法抛出一个异常，那么：

source: If a path is registered with multiple permission sets then any permission sets that specify an HTTP method will take precedence and permissions sets without a method will not be considered (assuming of course the method matches). In this instance, the permission sets without methods will only come into effect if the request method does not match any of the sets with method permissions.
zh_cn: 如果一个路径被注册了多个权限集，那么任何指定了HTTP方法的权限集将被优先考虑，没有指定方法的权限集将不被考虑 (当然, 假设方法匹配的话)。在这种情况下，没有指定方法的权限集只有在请求方法与任何有方法权限的权限集不匹配时才会生效。

source: If a record cannot be written, the message is nacked.
zh_cn: 如果一条记录无法写入，消息就会被拒绝。

source: If a request would match one or more permission sets based on the path, but does not match any due to method requirements then the request is rejected.
zh_cn: 如果一个请求匹配了一个或多个基于路径的权限集，但由于方法不匹配，那么该请求将被拒绝。

source: If a serializer/deserializer is set by configuration, it won't be replaced by the autodetection.
zh_cn: 如果一个序列化器/反序列化器是通过配置设置的，那么它不会被自动检测所取代。

source: If a topic already exists with the given name, the creation is skipped, without trying to re-partition the existing topic to a different number of partitions.
zh_cn: 如果具有某个指定名称的主题已经存在，那么创建会被跳过，并且不会尝试对已经存在的主题重新分区到不同的数量。

source: If a transaction is already associated with the current thread a `QuarkusTransactionException` will be thrown, otherwise a new transaction is started, and follows all the normal lifecycle rules.
zh_cn: 如果一个事务已经与当前线程相关联，将抛出一个 `QuarkusTransactionException` ，否则将启动一个新的事务，并遵循所有正常的生命周期规则。

source: If all is well quarkus will log:
zh_cn: 如果一切顺利的话，quarkus 会输出以下日志：

source: If an AMQP message is rejected/released/modified by the broker (or cannot be sent successfully), the message is nacked.
zh_cn: 如果一个AMQP消息被代理拒绝/释放/修改（或不能成功发送），那么该消息是不被认可的。

source: If an application relies on `java.security.Principal` returning a name then a token must have a `upn` or `preferred_username` or `sub` claim set. Setting this property will result in SmallRye JWT throwing an exception if none of these claims is available for the application code to reliably deal with a non-null `Principal` name.
zh_cn: 如果一个应用程序依赖于 `java.security.Principal` ，返回一个名称，那么一个标记必须有一个 `upn` 、 `preferred_username` 或 `sub` 的声明集。如果应用程序代码没有这些要求来可靠地处理非空的 `Principal` 名称，设置此属性将导致SmallRye JWT抛出一个异常。

source: If an extension for schema registry, such as `quarkus-apicurio-registry-avro` or `quarkus-confluent-registry-avro`, is present, Dev Services for Apicurio Registry automatically starts an Apicurio Registry instance in dev mode and when running tests. Also, all Kafka channels in SmallRye Reactive Messaging are automatically configured to use this registry. This automatic configuration only applies to serializers and deserializers from Apicurio Registry serde libraries and Confluent Schema Registry serde libraries, because there properties are set:
zh_cn: 如果存在模式注册表的扩展，如 `quarkus-apicurio-registry-avro` 或 `quarkus-confluent-registry-avro` ，则Apicurio注册表的开发服务会在开发模式下和运行测试时自动启动一个Apicurio注册表实例。此外，SmallRye 响应式消息中的所有Kafka通道都被自动配置为使用该注册表。这个自动配置只适用于Apicurio Registry serde库和Confluent Schema Registry serde库的序列化器和反序列化器，因为设置了以下属性：

source: If any Kafka-related extension is present (e.g. `quarkus-smallrye-reactive-messaging-kafka`), Dev Services for Kafka automatically starts a Kafka broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
zh_cn: 如果有任何Kafka相关的扩展（如 `quarkus-smallrye-reactive-messaging-kafka` ），Kafka开发服务会在开发模式和运行测试时自动启动一个Kafka broker。所以您不需要手动启动broker。这是由应用程序是自动配置的。

source: If both are present, Quarkus prioritizes configuration properties from the YAML file first and then from the Properties file. However, to avoid confusion, we recommend removing the Properties file.
zh_cn: 如果两者都存在，Quarkus会优先考虑YAML文件中的配置属性，接着是 Properties 文件中的配置属性。然而，为了避免混淆，我们建议删除 Properties 文件。

source: If by any means you need to use a custom resource or one that is provided by one of the https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] you can create multiple resource producers. The OpenTelemetry extension will detect the `Resource` CDI beans and will merge them when configuring the tracer producer.
zh_cn: 如果通过您需要的任何方式来使用自定义的资源或由 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK扩展] 之一提供的资源，您可以创建多个资源生产者。OpenTelemetry扩展将检测 `Resource` CDI beans，并在配置tracer生成器时将其合并。

source: If defined on a class, it is equivalent to defining it on all the methods of the class marked with `@Transactional`. The configuration defined on a method takes precedence over the configuration defined on a class.
zh_cn: 如果在一个类上定义，就相当于在该类所有标有 `@Transactional` 的方法上定义了它。在方法上定义的配置优先于在类上定义的配置。

source: If enabled, consumer's offset will be periodically committed in the background by the underlying Kafka client, ignoring the actual processing outcome of the records. It is recommended to NOT enable this setting and let Reactive Messaging handles the commit. Type: _boolean_
zh_cn: 如果启用，消费者的偏移量将由底层Kafka客户端在后台定期提交，并忽略记录的实际处理结果。建议不要启用这个设置，而是由Reactive Messaging来处理提交。 类型: _boolean_

source: If for example a custom serializer named `FooSerializer` for type `com.example.Foo` needs to be registered with JSON-B, the addition of a bean like the following would suffice:
zh_cn: 例如，如果需要使用 JSON-B 注册类型为 `com.example.Foo` 的名为 `FooSerializer` 的自定义序列化程序，则添加如下所示的 bean 就足够了：

source: If for some reason adding the aforementioned configuration to `application.properties` is not desirable, it is possible to configure the build tool to effectively perform the same operation.
zh_cn: 如果由于某种原因，将上述配置添加到 `application.properties` ，是不可取的，可以通过配置构建工具来有效地执行相同的操作。

source: If for whatever reason, the aforementioned solution is deemed unacceptable, there are alternatives.
zh_cn: 如果由于某种原因，上述解决方案被认为是不可接受的，那么还有其他选择。

source: If globs are not sufficiently precise for your use case and you need to rely on regular expressions or if you prefer relying on the GraalVM infrastructure, you can also create a `resources-config.json` (the most common location is within `src/main/resources`) JSON file defining which resources should be included:
zh_cn: 如果globs对于你的使用情况来说不够精确，你需要依靠正则表达式，或者你更喜欢依靠GraalVM的基础设施，你也可以创建一个 `resources-config.json` (最常见的位置是在`src/main/resources`) JSON文件，定义哪些资源应该被包含：

source: If in the DTO projection object you have a field from a referenced entity, you can use the `@ProjectedFieldName` annotation to provide the path for the SELECT statement.
zh_cn: 如果DTO投影对象中有来自引用的实体字段，可以使用 `@ProjectedFieldName` 注解指定SELECT语句使用的查询路径。

source: If it is the case in your production then it can be recommended that the token introspection and `UserInfo` data are cached for a short period of time, for example, for 3 or 5 minutes.
zh_cn: 如果在你的生产中有这种情况，那么可以建议将令牌自省和 `UserInfo` 数据缓存一小段时间，例如，3或5分钟。

source: If multiple permission sets specify the same path and method (or multiple have no method) then both permissions have to allow access for the request to proceed. Note that for this to happen both have to either have specified the method, or have no method, method specific matches take precedence as stated above:
zh_cn: 如果多个权限组指定了相同的路径和方法(或者多个权限组没有指定方法)， 那么这两个权限都必须允许访问才能使请求被处理。请注意，要做到这一点，两个权限要么都必须指定方法，要么都不指定方法。这里就如之前所述那样，有具体的方法匹配会优先：

source: If no transaction is active then a new transaction will be started, and committed when the method ends. If an exception is thrown the exception handler registered by `#exceptionHandler(Function)` will be called to decide if the TX should be committed or rolled back. If an existing transaction is active then the method is run in the context of the existing transaction. If an exception is thrown the exception handler will be called, however a result of `ExceptionResult#ROLLBACK` will result in the TX marked as rollback only, while a result of `ExceptionResult#COMMIT` will result in no action being taken.
zh_cn: 如果没有活动的事务，那么一个新的事务将被启动，并在方法结束时提交。如果一个异常被抛出，由 `#exceptionHandler(Function)` 注册的异常处理程序将被调用，以决定TX是否应该被提交或回滚。如果一个现有的事务处于活动状态，那么该方法将在现有事务的背景下运行。如果抛出一个异常，将调用异常处理程序，但是 `ExceptionResult#ROLLBACK` 的结果将导致TX被标记为回滚，而 `ExceptionResult#COMMIT` 的结果将导致不采取任何行动。

source: If no transaction is active then this semantic is basically a no-op. If a transaction is active then it is suspended, and resumed after the task is run. The exception handler will never be consulted when this semantic is in use, specifying both an exception handler and this semantic is considered an error. This semantic allows for code to easily be run outside the scope of a transaction.
zh_cn: 如果没有事务处于活动状态，那么这个语义基本上就是一个无用功。如果一个事务处于活动状态，那么它就会被暂停，并在任务运行之后恢复。在使用这种语义的时候，将永远不会查询异常处理程序，同时指定异常处理程序和这种语义被认为是一个错误。这种语义允许在事务的范围之外轻松地运行代码。

source: If not set, `key.deserializer` is set to `org.apache.kafka.common.serialization.StringDeserializer`.
zh_cn: 如果没有设置， `key.deserializer` 则会被设置为 `org.apache.kafka.common.serialization.StringDeserializer` 。

source: If not set, `key.serializer` is set to `org.apache.kafka.common.serialization.StringSerializer`.
zh_cn: 如果没有设置， `key.serializer` 则会被设置为 `org.apache.kafka.common.serialization.StringSerializer` 。

source: If not set, `reconnect.backoff.max.ms` is set to `10000` to avoid high load on disconnection.
zh_cn: 如果没有设置， `reconnect.backoff.max.ms` 则会被配置为 `10000` ，以避免断开时导致的高负载。

source: If not set, producer `client.id` is generated as `kafka-producer-[channel]`.
zh_cn: 如果没有设置，生产者 `client.id` 则会按照 `kafka-producer-[channel]` 来生成。

source: If not set, the address is the fully qualified name of the bean; for instance, in this snippet, it's `org.acme.vertx.GreetingService`.
zh_cn: 如果没有设置，地址是Bean的完全限定名称；例如，在这个片段中，它是 `org.acme.vertx.GreetingService` 。

source: If one of those extensions is present, then creating a container image for the native executable is essentially a matter of executing a single command:
zh_cn: 如果这些扩展之一是存在的，那么为原生可执行文件创建一个容器镜像基本上就是执行一个命令的问题：

source: If running `gdb` from a different directory than `target`, then the sources can be loaded by running:
zh_cn: 如果从与 `target` 不同的目录下运行 `gdb` ，那么可以通过运行源代码加载：

source: If set to a positive number, the connector will try to resend any record that was not delivered successfully (with a potentially transient error) until the number of retries is reached. If set to 0, retries are disabled. If not set, the connector tries to resend any record that failed to be delivered (because of a potentially transient error) during an amount of time configured by `delivery.timeout.ms`. Type: _long_
zh_cn: 如果设置为正数，连接器将尝试重新发送任何没有成功传递的记录（有可能是瞬时错误），直到达到重试的上限。如果设置为0，重试将被禁用。如果不设置，连接器会在 `delivery.timeout.ms` 配置的时间内，尝试重新发送任何未能交付的记录（由于潜在的瞬时错误）。 类型: _long_

source: If set to true, the access will be denied for all JAX-RS endpoints by default, so if a JAX-RS endpoint does not have any security annotations then it will default to `@DenyAll` behaviour. This is useful to ensure you cannot accidentally expose an endpoint that is supposed to be secured. Defaults to `false`.
zh_cn: 如果设为 true，默认情况下将拒绝所有 JAX-RS 节点的访问，所以如果一个 JAX-RS 节点没有任何安全注解，那么它将默认为 `@DenyAll` 注解。这对于确保您不会意外地暴露出一个本应是安全的节点很有用。默认为 `false` 。

source: If set, configure the hostname value used for the connection AMQP Open frame and TLS SNI server name (if TLS is in use) Type: _string_
zh_cn: 如果设置了，配置用于连接AMQP开放框架和TLS SNI服务器名称的主机名值（如果正在使用TLS） 类型: _string_

source: If set, explicitly override the hostname to use for the TLS SNI server name Type: _string_
zh_cn: 如果设置了，明确地覆盖用于TLS SNI服务器名称的主机名 类型: _string_

source: If the JWT token can not be injected, for example, if it is embedded in the service request payload or the service endpoint acquires it out of band, then one can use `JWTParser`:
zh_cn: 如果JWT令牌不能被注入，例如，如果它被嵌入到服务请求的有效载荷中，或者服务端点在带外获得它，那么人们可以使用 `JWTParser` ：

source: If the Kafka Dev Service is available during tests, `KafkaCompanionResource` uses the created Kafka broker, otherwise it creates a Kafka broker using https://github.com/strimzi/test-container[Strimzi Test Container].
zh_cn: 如果Kafka Dev Service在测试期间是可用的， `KafkaCompanionResource` 则会使用创建的Kafka broker，否则就使用 link:https://github.com/strimzi/test-container[Strimzi测试容器]创建一个Kafka broker。

source: If the Micrometer registry you would like to use does not yet have an associated extension, use the `quarkus-micrometer` extension and bring in the packaged MeterRegistry dependency directly:
zh_cn: 如果您想使用的Micrometer registry还没有对应的扩展，请使用 `quarkus-micrometer` 扩展，并直接添加已打包的MeterRegistry依赖：

source: If the NVE database flags a CVE against a Quarkus tag, a link that provides more details about the CVE is added to the given CPE name entry.
zh_cn: 如果NVE数据库针对一个Quarkus tag标记了一个CVE，那么一个提供了这个CVE更多细节的链接就会被添加到给定的CPE名录下。

source: If the `address` attribute is not set, the connector uses the channel name.
zh_cn: 如果没有设置 `address` 属性，连接器将使用通道名称。

source: If the `com.fasterxml.jackson.module:jackson-module-kotlin` dependency and the `quarkus-jackson` extension (or one of the `quarkus-resteasy-jackson` or `quarkus-resteasy-reactive-jackson` extensions) have been added to the project, then Quarkus automatically registers the `KotlinModule` to the `ObjectMapper` bean (see xref:rest-json.adoc#jackson[this] guide for more details).
zh_cn: 如果 `com.fasterxml.jackson.module:jackson-module-kotlin` 依赖和 `quarkus-jackson` 扩展（或 `quarkus-resteasy-jackson` 或 `quarkus-resteasy-reactive-jackson` 其中之一）已经被添加到项目中，那么 Quarkus 会自动将 `KotlinModule` 注册到 `ObjectMapper` Bean 中（更多细节请参见 link:rest-json.html#jackson[这篇指南] ）。

source: If the `group.id` attribute is not set, it defaults the `quarkus.application.name` configuration property.
zh_cn: 如果没有设置 `group.id` ，则其默认与 `quarkus.application.name` 相同。

source: If the `iss` property is tenant specific in a multi-tenant deployment then you can use the `SecurityIdentity` `tenant-id` attribute to check the issuer is correct in the endpoint itself or the custom JAX-RS filter, for example:
zh_cn: 如果在多租户部署中， `iss` 属性是租户特定的，那么你可以使用 `SecurityIdentity` `tenant-id` 属性来检查端点本身或自定义 JAX-RS 过滤器中的签发者是否正确，例如：

source: If the connector cannot extract the Cloud Event metadata, it sends the Message without the metadata.
zh_cn: 如果连接器不能提取云事件元数据，它将发送没有元数据的消息。
